# pandas

## Intro
Pandas is a data manipulation and data analysis library for Python. It is built on the Numpy package and its key data structure is called the DataFrame.

It is written in Python, C and Cython

**Stable release**: 0.23.4 / 3 August 2018

In [2]:
import pandas as pd
import numpy as np

Loading data from a CSV file

In [20]:
df = pd.read_csv("data/train.csv")

Find the number of rows in a dataframe

In [13]:
print(df.shape)
# df[1].count()
len(df.index)

(5000, 12)

5000

<center>**Plot between number of rows in a dataframe & seconds per loop**</center>

![Comparison of len, count and shape](img/count-len-shape-comparison.png)

<center>[Source](https://stackoverflow.com/questions/15943769/how-do-i-get-the-row-count-of-a-pandas-dataframe)</center>

### head() and tail()

- head(n = 5) - returns the first n rows.   
- tail(n = 5) - returns the last n rows.   
- Default value of n is 5.

In [35]:
df.head()
df.tail()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
10881,2012-12-19 19:00:00,4,0,1,1,15.58,19.695,50,26.0027,7,329,336
10882,2012-12-19 20:00:00,4,0,1,1,14.76,17.425,57,15.0013,10,231,241
10883,2012-12-19 21:00:00,4,0,1,1,13.94,15.910,61,15.0013,4,164,168
10884,2012-12-19 22:00:00,4,0,1,1,13.94,17.425,61,6.0032,12,117,129
10885,2012-12-19 23:00:00,4,0,1,1,13.12,16.665,66,8.9981,4,84,88

### usecols, nrows, skiprows, header

In [36]:
df = pd.read_csv("data/train.csv", nrows = 5000)
df.shape

(5000, 12)

In [13]:
df = pd.read_csv("data/train.csv", nrows = 5000, skiprows = (0,2000)) 
# include header = None also
df.head()

   2011-01-01 00:00:00  1  0  0.1  1.1  9.84  14.395  81     0.2  3  13  16
0  2011-01-01 01:00:00  1  0    0    1  9.02  13.635  80  0.0000  8  32  40
1  2011-01-01 02:00:00  1  0    0    1  9.02  13.635  80  0.0000  5  27  32
2  2011-01-01 03:00:00  1  0    0    1  9.84  14.395  75  0.0000  3  10  13
3  2011-01-01 04:00:00  1  0    0    1  9.84  14.395  75  0.0000  0   1   1
4  2011-01-01 05:00:00  1  0    0    2  9.84  12.880  75  6.0032  0   1   1

In [19]:
df = pd.read_csv("data/train.csv", nrows = 5000, usecols = ['season','workingday','count'])
df.head()

   season  workingday  count
0       1           0     16
1       1           0     40
2       1           0     32
3       1           0     13
4       1           0      1

### pandas.to_datetime

When a csv file is imported and a Data Frame is made, the Date time objects in the file are read as a string object rather a Date Time object and Hence itâ€™s very tough to perform operations like Time difference on a string rather a Date Time object. Pandas to_datetime() method helps to convert string Date time into Python Date time object.

In [50]:
df['datetime_object'] = pd.to_datetime(df['datetime'])
df.head()
# df.info()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,datetime_object
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,2011-01-01 00:00:00
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,2011-01-01 01:00:00
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32,2011-01-01 02:00:00
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13,2011-01-01 03:00:00
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1,2011-01-01 04:00:00

## loc() and iloc()

Both are used to slice a dataframe and get a subset of it. 

`ix()` - less strict version of loc() and iloc(), deprecated now.

In [15]:
df = pd.read_csv("data/train.csv")
df.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

### loc()

Methods for purely label based indexing. When slicing, the start bound is also included. Integers are valid labels, but they refer to the label and not the position.

In [28]:
df_loc = df.loc[:,['season', 'weather', 'temp']]
df_loc.head()

   season  weather  temp
0       1        1  9.84
1       1        1  9.02
2       1        1  9.02
3       1        1  9.84
4       1        1  9.84

`loc()` can even be used when the rows have character values as indices - this happens when a non-numeric column in the dataframe is set as the index of the dataframe. In such cases, the row identifiers are passed as the indeces. <br/> 

For example, 
```python 
df.loc['a':'g',['season', 'weather', 'temp']]
```

### iloc()

- Method for purely integer-based indexing. 
- Follows 0 indexing

In [21]:
df_iloc = df.iloc[1:,3:7]
df_iloc.head()

   workingday  weather  temp   atemp
1           0        1  9.02  13.635
2           0        1  9.02  13.635
3           0        1  9.84  14.395
4           0        1  9.84  14.395
5           0        2  9.84  12.880

Select a range of rows for all columns

In [33]:
df.iloc[4:9]

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,0,1,1
5,2011-01-01 05:00:00,1,0,0,2,9.84,12.880,75,6.0032,0,1,1
6,2011-01-01 06:00:00,1,0,0,1,9.02,13.635,80,0.0000,2,0,2
7,2011-01-01 07:00:00,1,0,0,1,8.20,12.880,86,0.0000,1,2,3
8,2011-01-01 08:00:00,1,0,0,1,9.84,14.395,75,0.0000,1,7,8

**Negative Indexing**

Create a dataframe with all rows and all columns except the last one.

In [31]:
df.iloc[:6,:-1]

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0000,3,13
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0000,8,32
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0000,5,27
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0000,3,10
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,0,1
5,2011-01-01 05:00:00,1,0,0,2,9.84,12.880,75,6.0032,0,1

## Identifying, dropping and imputing missing values

Drop a particular column or columns.

In [53]:
# df.drop(columns = ['casual','registered'], axis = 0, inplace = True)
df.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,count,datetime_object
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,16,2011-01-01 00:00:00
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,40,2011-01-01 01:00:00
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,32,2011-01-01 02:00:00
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,13,2011-01-01 03:00:00
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,1,2011-01-01 04:00:00

Drop rows

In [60]:
df.drop([2,7], inplace = True)
df.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,count,datetime_object
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0000,16,2011-01-01 00:00:00
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0000,40,2011-01-01 01:00:00
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0000,13,2011-01-01 03:00:00
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,1,2011-01-01 04:00:00
5,2011-01-01 05:00:00,1,0,0,2,9.84,12.880,75,6.0032,1,2011-01-01 05:00:00

Identify missing values

In [62]:
df.isnull().sum()
# 100*df.isnull().sum()/len(df.index)

datetime           0.0
season             0.0
holiday            0.0
workingday         0.0
weather            0.0
temp               0.0
atemp              0.0
humidity           0.0
windspeed          0.0
count              0.0
datetime_object    0.0
dtype: float64

Drop missing values

[Pandas dropna documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html#pandas.DataFrame.dropna)

In [ ]:
# df.dropna(subset = ['season', 'weather'], inplace = True)

In [ ]:
# introduce missing values and then drop those rows

Fill Missing values - Missing value imputation

### unique() and nunique()

Find the number of unique values in a column (Especially useful to find the number of unique classes in a categorical variable)

In [24]:
df['season'].unique() # can be applied only to a column, not the entire dataframe

array([1, 2, 3, 4], dtype=int64)

In [27]:
df['season'].nunique()

4

## Sorting and Grouping

## Merge

![Join Types](img/join-types-merge-names.jpg)

<center>[Source](https://www.shanelynn.ie/merge-join-dataframes-python-pandas-index-1/)</center>

**Types of merges**

- Inner Merge / Inner join â€“ The default Pandas behaviour, only keep rows where the merge â€œonâ€ value exists in both the left and right dataframes.


- Left Merge / Left outer join â€“ (aka left merge or left join) Keep every row in the left dataframe. Where there are missing values of the â€œonâ€ variable in the right dataframe, add empty / NaN values in the result.


- Right Merge / Right outer join â€“ (aka right merge or right join) Keep every row in the right dataframe. Where there are missing values of the â€œonâ€ variable in the left column, add empty / NaN values in the result.


- Outer Merge / Full outer join â€“ A full outer join returns all the rows from the left dataframe, all the rows from the right dataframe, and matches up rows where possible, with NaNs elsewhere.

In [67]:
# laod the datasets and analyse
user_usage = pd.read_csv("data/user_usage.csv")
user_usage.head()

   outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb  use_id
0                    21.97                    4.82     1557.33   22787
1                  1710.08                  136.88     7267.55   22788
2                  1710.08                  136.88     7267.55   22789
3                    94.46                   35.17      519.12   22790
4                    71.59                   79.26     1557.33   22792

In [66]:
user_device = pd.read_csv("data/user_device.csv")
user_device.head()

   use_id  user_id platform  platform_version     device  use_type_id
0   22782    26980      ios              10.2  iPhone7,2            2
1   22783    29628  android               6.0    Nexus 5            3
2   22784    28473  android               5.1   SM-G903F            1
3   22785    15200      ios              10.2  iPhone7,2            3
4   22786    28239  android               6.0  ONE E1003            1

In [69]:
devices = pd.read_csv("data/android_devices.csv")
devices.head()

  Retail Branding Marketing Name    Device                      Model
0             NaN            NaN    AD681H  Smartfren Andromax AD681H
1             NaN            NaN     FJL21                      FJL21
2             NaN            NaN       T31              Panasonic T31
3             NaN            NaN  hws7721g         MediaPad 7 Youth 2
4              3Q        OC1020A   OC1020A                    OC1020A

We would like to determine if the usage patterns for users differ between different devices. For example, do users using Samsung devices use more call minutes than those using  LG devices?

We want to form a single dataframe with columns for user usage figures (calls per month, sms per month etc) and also columns with device information (platform, device, etc).

In [74]:
result = pd.merge(user_usage,
                 user_device[['use_id', 'platform', 'device']],
                 on='use_id')
result.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.97,4.82,1557.33,22787,android,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F

In [75]:
print("user_usage dimensions ", user_usage.shape)
print("result dimensions ", result.shape)
print("Missing values in results ", result['device'].isnull().sum())

user_usage dimensions  (240, 4)
result dimensions  (159, 6)
Missing values in results  0

Now merge the dataframes in such a way that we can retain all the values in the `device` column.

In [76]:
result = pd.merge(user_usage,
                 user_device[['use_id', 'platform', 'device']],
                 on='use_id', 
                 how='left')

In [77]:
print("user_usage dimensions ", user_usage.shape)
print("result dimensions ", result.shape)
print("Missing values in results ", result['device'].isnull().sum())

user_usage dimensions  (240, 4)
result dimensions  (240, 6)
Missing values in results  81

**What if the dataframes do not have the same column names which we plan on merging with? **

![Different Parameters of Merge](img/pandas-merge-join-different-variable-names.png)

### Export to CSV

In [ ]:
result.to_csv("data/exported_data.csv", index = False, header = True)

**Other parameters**

`columns` : sequence, optional<br/>
Columns to write.

`sep` : str, default â€˜,â€™<br/>
String of length 1. Field delimiter for the output file.

`chunksize` : int or None<br/>
Rows to write at a time.

`date_format` : str, default None<br/>
Format string for datetime objects.

For example, 
```python
df.to_csv(file_name, index = False, header = True, sep='\t', encoding='utf-8')
```

## Memory Optimization with pandas

Why optimize memory? 

Memory usage can be a major problem while dealing with large datasets. For example, the PUBG challenge and Microsoft challenge. Let's say the dataset size is 4GB. Loading this onto the RAM and doing operations will become very costly (time-wise). This is where we try to reduce the memory consumed. 


Source - This Kaggle [Kernel](https://www.kaggle.com/yuliagm/how-to-work-with-big-datasets-on-16g-ram-dask)

- TIP 1 - Deleting unused variables and gc.collect()
- TIP 2 - Presetting the datatypes
- TIP 3 - Importing selected rows of the a file (including generating your own subsamples)
- TIP 4 - Importing in batches and processing each individually
- TIP 5 - Importing just selected columns
- TIP 6 - Using Dask

Load the PUBG dataset and show the memory usage. Show dtype of each column. (memory_usage and info). show ram. Then delete it and do gc.collect(). 
Show RAM again.

### TIP 1 - Deleting unused variables and gc.collect()

The thing about python is that once it loads something into RAM it doesn't really get rid of it effectively. So if you load a huge dataframe into pandas, and then make a copy of it and never use it again, that original dataframe will still be in your RAM. Eating away at your memory. Same goes for any other variables you create.

Therefore if you used up a dataframe (or other variable), get in the habit of deleting it.

For example, if you create a dataframe  `temp`, extract some features and merge results to your main training set, `temp` will still be eating up space. You need to explicitely delete it by stating `del temp`. You also need to make sure that nothing else is referring to `temp` (you don't have any other variables bound to it).

Even after doing so there may still be residual memory usage going on.

That's where the garbage collection module comes in.  import gc at the beginning of your project, and then each time you want to clear up space put command `gc.collect()`. 

The memory used by a dataframe can be found out by using the `memory_usage()` method or the `info()` method. <br/>
`info()` directly displays the memory consumed by the entire dataframe in MBs whereas `memory_usage()` shows the same for each column of the dataframe.

In [63]:
import pandas as pd
import numpy as np
df = pd.read_csv("data/PUBG_train.csv")

df.memory_usage().sum()/1024**2

In [ ]:
# del df

# import gc
# gc.collect() # check the RAM usage from Task Manager

### TIP 2 - Presetting the datatypes

Python does not effectively utilize memory. Python automatically sets the datatypes while loading a dataset. Load the PUBG dataset and see the datatypes of each column.

In [65]:
df.dtypes

Id                  object
groupId             object
matchId             object
assists              int64
boosts               int64
damageDealt        float64
DBNOs                int64
headshotKills        int64
heals                int64
killPlace            int64
killPoints           int64
kills                int64
killStreaks          int64
longestKill        float64
matchDuration        int64
matchType           object
maxPlace             int64
numGroups            int64
rankPoints           int64
revives              int64
rideDistance       float64
roadKills            int64
swimDistance       float64
teamKills            int64
vehicleDestroys      int64
walkDistance       float64
weaponsAcquired      int64
winPoints            int64
winPlacePerc       float64
dtype: object

We can solve this problem by presetting the variables. Say we know which datatype each column takes, then we can create a dictionary of each column and their corresponding datatype and pass it to the `dtype` argument in `pd.read_csv`.

In [ ]:
dtypes = {
            'Id'                : 'object',
            'groupId'           : 'object',
            'matchId'           : 'object',
            'assists'           : 'int8',
            'boosts'            : 'int8',
            'damageDealt'       : 'float16',
            'DBNOs'             : 'int8',
            'headshotKills'     : 'int8', 
            'heals'             : 'int8',    
            'killPlace'         : 'int8',    
            'killPoints'        : 'int16',    
            'kills'             : 'int8',    
            'killStreaks'       : 'int8',    
            'longestKill'       : 'float16',
            'matchDuration'     : 'int16',
            'matchType'         : 'object',
            'maxPlace'          : 'int8',    
            'numGroups'         : 'int8',
            'rankPoints'        : 'int16',
            'revives'           : 'int8',    
            'rideDistance'      : 'float16',    
            'roadKills'         : 'int8',    
            'swimDistance'      : 'float16',    
            'teamKills'         : 'int8',    
            'vehicleDestroys'   : 'int8',    
            'walkDistance'      : 'float16',    
            'weaponsAcquired'   : 'int8',    
            'winPoints'         : 'int8', 
            'winPlacePerc'      : 'float16' 
}

df = pd.read_csv("data/PUBG_train.csv", dtype = dtypes)

But we need not know or guess the datatype of each of the columns. In such cases, the below function helps us identify the dataypes.

In [ ]:
df = reduce_mem_usage(df)
df.memory_usage().sum()/1024**2

In [ ]:
# Memory saving function credit to https://www.kaggle.com/gemartin/load-data-reduce-memory-usage
def reduce_mem_usage(df):
    """ iterate through all the columns of a dataframe and modify the data type
        to reduce memory usage.        
    """
    #start_mem = df.memory_usage().sum() / 1024**2
    #print('Memory usage of dataframe is {:.2f} MB'.format(start_mem))

    for col in df.columns:
        col_type = df[col].dtype

        if col_type != object:
            c_min = df[col].min()
            c_max = df[col].max()
            if str(col_type)[:3] == 'int':
                if c_min > np.iinfo(np.int8).min and c_max < np.iinfo(np.int8).max:
                    df[col] = df[col].astype(np.int8)
                elif c_min > np.iinfo(np.int16).min and c_max < np.iinfo(np.int16).max:
                    df[col] = df[col].astype(np.int16)
                elif c_min > np.iinfo(np.int32).min and c_max < np.iinfo(np.int32).max:
                    df[col] = df[col].astype(np.int32)
                elif c_min > np.iinfo(np.int64).min and c_max < np.iinfo(np.int64).max:
                    df[col] = df[col].astype(np.int64)  
            else:
                if c_min > np.finfo(np.float16).min and c_max < np.finfo(np.float16).max:
                    df[col] = df[col].astype(np.float16)
                elif c_min > np.finfo(np.float32).min and c_max < np.finfo(np.float32).max:
                    df[col] = df[col].astype(np.float32)
                else:
                    df[col] = df[col].astype(np.float64)

    #end_mem = df.memory_usage().sum() / 1024**2
    #print('Memory usage after optimization is: {:.2f} MB'.format(end_mem))
    #print('Decreased by {:.1f}%'.format(100 * (start_mem - end_mem) / start_mem))
    
    return df

In [ ]:
# explain the above code

What the above code does is that for every non-character column in the dataframe (non-object), it first identifies if the column has interger values or floating point values, based on the first 3 characters of that column's `dtype`. 

Then it finds the minimum and maximum values of that column and compares these values to find which